Tekla Open API Reference for Tekla Structures 2025
AnalysisLocalCoordinateSystem.LocalX Property
 The local X direction.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector LocalX { get; }
Public ReadOnly Property LocalX As Vector
	Get
Property Value
Type: Vector
See Also
Reference
AnalysisLocalCoordinateSystem Class
Tekla.Structures.Analysis Namespace